/*
1. 자신의 이름을 gets() 함수로 입력받아 printf() 함수로 출력

2. 변수에 상수를 입력 후 출력 '=' 사용
   정수형(10진수, 8진수, 16진수로 출력)
   실수형(소숫점 2째 자리까지 출력) 
   1개의 문자(문자 및 10진수로 각각 출력)
   각각 변수의 주소값 출력(16진수로 출력)

3. 소수점 3자리 실수를 입력 받아 첫째, 둘째, 셋째 자리에서 각각 반올림하여 출력
   예) 소수점 3자리 실수 입력 : (12.345)
       출력 : 12, 12.3, 12.35

4. 화씨 온도를 입력한 후 섭씨온도로 출력(단, 소수 첫째 자리까지)
   참조) 섭씨온도 = 5 / 9 * (화씨온도 - 32 )

5. 세 개의 정수를 입력한 후 합계와 평균을 출력
   (단, 평균은 소수 둘째 자리에서 반올림)

6. 한 개의 영문자를 입력한 후 알파벳에서 몇 
   번째 문자인지 출력 
   출력예) 영문자 입력 : C
           결과 : C는 3번째 알파벳이다.

7. 두 개의 정수를 두 개의 변수에 입력한 후 내용을 서로 교환하여 출력
   출력예) 두 정수  : 1, 2
           교환결과 : 2, 1

9. 두 수를 입력 받아 덧셈 연산
   출력예) 정수 입력 : 3
           정수 입력 : 2
           두 정수의 합 : 5

10. 문자 하나를 입력받아 숫자로 변환하여 출력
     출력예) 문자입력 : 3
             숫    자 : 3
*/